[
  {
    "term": [
      "Trisolaris"
    ],
    "description": "<p><i>Trisolaris</i> refers to the home star system of extraterrestrial civilization known as the \"Trisolarans\".</p>\n<p>Trisolaris is a chaotic tripple-star system, which means there are three suns in a solar system. This unstable configuration creates extreme and unpredictable environmental conditions on Trisolaris' only habitable planet. Trisolarans are eager to leave the unstable environment. Therefore, in the story, Trisolarans launch the fleet immediately after they knows the existence of humans ignoring the distance. </p>"
  },
  {
    "term": [
      "Trisolaran",
      "Trisolarans"
    ],
    "description": "<b>Trisolaran</b> is the species living in the Trisolaris. It is the main enemy of the Earth."
  },
  {
    "term": [
      "No.1379 Trisolaran Listener"
    ],
    "description": "The job of a listener is to listen to the possible signals sent by other civilizations. <b>The No.1379 Trisolaran Listener</b> learns the culture and knows the stabe environment of the Earth from Ye's message. It does not want to help its civilization to aggress the Earth, so it does not hope humans to reply to its message and expose the direction and the distance."
  },
  {
    "term": [
      "Sophon",
      "Sophons"
    ],
    "description": "<p><b>Sophon</b> is an imaginary weapon made by Trisolarans. In the story, Trisolarans unfold a proton into two dimensions; then etch circuits on its surface, and fold it back into 11 dimensions. This is the production process of a Sophon.</p>\n<p>Sophons use quantum entanglement technology for instant messaging. Trisolarans use Sophon to keep watching humans and interfere in the humans' experiment equipments. </p>\n<p>\"Your destruction is none of my concern. \"</p>"
  },
  {
    "term": [
      "Earth-Trisolaris Organization",
      "ETO"
    ],
    "description": "<p><b>Earth-Trisolaris Organization</b> (ETO) is established by Ye. There are three main factions in the ETO: Redemptionists, Adventists, and Survivalists. </p>\n<p>The Redemptionists believes that Trisolarans can save humans. The Redemptionists wants to learn the technologies from Trisolarans and save humans. </p>\n<p>The Adventists is the core of the ETO. The Adventists believes that humans are no worth saving. The Adventists advocates to completely destroy humans. </p>\n<p>The Survivalists is the weakest faction. Its goal is to seek the life chance after the Trisolarans' invasion. </p>"
  },
  {
    "term": [
      "Frontiers of Science"
    ],
    "description": "<b>Frontiers of Science</b> is an organization that is established by ETO. Its superficial purpose is \"exploring the limitations of science\". The real purpose is to swerve the faith (the doubt of the laws of physics) of the scientists."
  },
  {
    "term": [
      "Ye's secret"
    ],
    "description": "In the story, Ye's daughter discovers that Ye is the lead of ETO; Ye is the prime culprit behind the suicide of scientists. She is difficult to accept the fact."
  },
  {
    "term": [
      "Three Body"
    ],
    "description": "The game <b><i>Three Body</i></b> is designed by ETO. It is used to screen the scientists who are sympathetic to Trisolarans. ETO uses this game to recruit."
  },
  {
    "term": [
      "Planetary Denfense Council",
      "PDC"
    ],
    "description": "<p><b>Planetary Denfense Council</b> (PDC) is an organization. Its goal is that in 400 years (before the First Trisolaris Fleet arrives), develop effective counterattack capability. </p>\n<p>PDC designs Wallfacer Project, and it is successfully completed. </p>"
  },
  {
    "term": [
      "Hibernation Technology"
    ],
    "description": "<b>Hibernation Technology</b> a fictional technology enabled humans to tralvel to the future without lifespan consumption."
  },
  {
    "term": [
      "PDC Strategic Intelligence Agency",
      "PIA"
    ],
    "description": "<b>PDC Strategic Intelligence Agency</b> (PIA) is a special department of PDC. Different to other departments, PIA focuses on asymmetric strategy, which is fighting Trisolarans by spy, psychological warfare, or technical deception."
  },
  {
    "term": [
      "Staircase Program"
    ],
    "description": "<b>Staircase Program</b> is designed by PIA. The program is to launch a spaceship with a spy to get the information of Trisolarans."
  },
  {
    "term": [
      "ecapism"
    ],
    "description": "<b>Ecapism</b> is a thought that advocates escaping the Solar System to avoid the invasion of Trisolarans."
  },
  {
    "term": [
      "Wallfacer Project"
    ],
    "description": "<p><b>Wallfacer Project</b> is launched by PDC. The project is organized by four Wallfacers. Their job is to design a strategic plan based solely on their own thinking. They cannot share their thinking to everyone else. </p>\n<p>The project uses a trait that Trisolarans do not good at strategy. </p>"
  },
  {
    "term": [
      "Wallfacer",
      "Wallfacers"
    ],
    "description": "<b>Wallfacers</b> are the executors of Wallfacer Project. Wallfacers are indowed with immense power to execute their plans that are only in their mind."
  },
  {
    "term": [
      "Wallbreaker",
      "Wallbreakers"
    ],
    "description": "<b>Wallbreakers</b> are appointed by ETO. Wallbreakers help Trisolarans to guess and crack Wallfacers' plans."
  },
  {
    "term": [
      "Stars Our Destination Project"
    ],
    "description": "<b>Stars Our Destination Project</b> is launched by the United Nations. The project sells stars and planets outside the Solar System through auction. The profit is used to defend the Earth."
  },
  {
    "term": [
      "Dark Forest Theory"
    ],
    "description": "<p><b>Dark Forest Theory</b> is the key setting of the story. Dark Forest Theory is a fictional theory, which assumes two axioms.</p>\n<ol>\n<li><b>Survival is the primary need of civilization. </b></li>\n<li><b>Civilization continuously grows and expands, but the total matter in the universe remains constant. </b></li>\n</ol>\n<p>From these two axioms, plus a hypothetical concept that <b>technological explosion is common in the universe</b>, it can infer that the <b>suspicion chain</b> exists between civilizations. </p>\n<p>Dark Forest Theory reveals that the civilizations in the universe are both \"hunters\", but they are also \"preys\". Specifically, according to Dark Forest Theory, once a civilization exposes its position in the universe, it will be attacked by other civilizaions. The theory provides an explanation of the Fermi Paradox, and presents the brutal truth of the universe."
  },
  {
    "term": [
      "Photoid"
    ],
    "description": "<b>Photoid</b> is a fictional cosmic weapon used for Dark Forest Strike. It can easily destroy a star."
  },
  {
    "term": [
      "Dark Forest Strike"
    ],
    "description": "When a civilization exposes its position, the attack it gets is called <b>Dark Forest Strike</b>. Dark Forest Strike is always economical, and it is used to clean up the low-level civilizaions."
  },
  {
    "term": [
      "Luo's experiment"
    ],
    "description": "<b>Luo's experiment</b> is to test if Dark Forest Theory is correct. In the story, Luo exposes the position of 187J3X1 to the universe, and then 187J3X1 is attacked."
  },
  {
    "term": [
      "Droplet"
    ],
    "description": "<b>Droplet</b> is a fictional weapon created by Trisolarans. It is made of strong interaction force material. It is destructive weapon to humans."
  },
  {
    "term": [
      "Snow Project"
    ],
    "description": "<b>Snow Project</b> is designed by Luo. Luo depends on the project to build the Dark Forest Deterrence."
  },
  {
    "term": [
      "Dark Forest Deterrence"
    ],
    "description": "In the story, the <b>Dark Forest Deterrence</b> built by Luo is the mean for dying together. It can expose the position of Trisolaris. But because Trisolaris is too close to the Earth, it will also expose the position of the Earth."
  },
  {
    "term": [
      "Swordholder"
    ],
    "description": "<p><b>Swordholder</b> is the person who master the facility for Dark Forest Deterrence. </p>\n<p>In the story, the second Swordholder Cheng Xin does not have the consciousness to destroy both Trisolaris and the Earth, so the deterrence fails when Trisolarans attack the facility used for Dark Forest Deterrence. </p>"
  },
  {
    "term": [
      "Black Domain Project"
    ],
    "description": "<b>Black Domain Project</b> is to reduce the lightspeed in the Solar System. This can avoid the possible attacks from outside."
  },
  {
    "term": [
      "Bunker Project"
    ],
    "description": "<b>Bunker Project</b> is to use the planets of the Solar System as \"bunkers\" to protect the spacecrafts that people are living from Photoid."
  },
  {
    "term": [
      "Curvature Engine"
    ],
    "description": "<b>Curvature Engine</b> is a fictional technology. The spaceships using Curvature Engine can reach a speed above 99.9% of lightspeed."
  },
  {
    "term": [
      "Singer Civilization"
    ],
    "description": "<b>Singer Civilizaion</b> is an unknown high-level civilization that attack humans by Dual-Vector Foil."
  },
  {
    "term": [
      "Dual-Vector Foil"
    ],
    "description": "<b>Dual-Vector Foil</b> is a fictional weapon that is \"economical\" to high-level civilizations such as Singer Civilization used to clean up low-level civilizations. Dual-Vector Foil can easily two-dimensionalize a solar system."
  }
]