[
  {
    "term": [
      "Trisolaris"
    ],
    "description": "<p><b>Trisolaris</b> refers to the home star system of extraterrestrial civilization known as the \"Trisolarans\".</p>\n<p>Trisolaris is a chaotic tripple-star system, which means there are three suns in a solar system. This unstable configuration creates extreme and unpredictable environmental conditions on Trisolaris' only habitable planet. Trisolarans are eager to leave the unstable environment. Ignoring the distance, Trisolarans launch the fleet immediately after they knows the existence of humans. </p>"
  },
  {
    "term": [
      "Trisolaran",
      "Trisolarans"
    ],
    "description": "<b>Trisolaran</b> is the species living in the Trisolaris. It is the main enemy of the Earth."
  },
  {
    "term": [
      "No.1379 Trisolaran Listener"
    ],
    "description": "The Listener's job is to monitor potential signals from other civilizations. <b>The No.1379 Trisolaran Listener</b> learns about the Earth's culture and stable environment through Ye's message. It does not want to help its civilization invade the Earth, so it hopes that humans will not reply to its message and reveal their location or distance."
  },
  {
    "term": [
      "Sophon",
      "Sophons"
    ],
    "description": "<p><b>Sophon</b> is an imaginary weapon made by Trisolarans. In the story, Trisolarans unfold a proton into two dimensions; then etch circuits on its surface, and fold it back into eleven dimensions. This is the production process of a Sophon.</p>\n<p>Sophons use quantum entanglement technology for instant messaging. Trisolarans use Sophon to keep watching humans and interfere in the humans' experiment equipments. </p>"
  },
  {
    "term": [
      "Earth-Trisolaris Organization",
      "ETO"
    ],
    "description": "<p><b>Earth-Trisolaris Organization</b> (ETO) is established by Ye. It consists of three main factions: the Redemptionists, the Adventists, and the Survivalists. </p>\n<p>The Redemptionists believe that Trisolarans can save humanity. They seek to acquire advanced technology from Trisolarans in order to help humanity survive. </p>\n<p>The Adventists form the core of the ETO. They believe that humans are not worth saving and advocate complete destruction of humans. </p>\n<p>The Survivalists are the weakest faction. Their goal is to increase their chances of survival after the Trisolarans' invasion. </p>"
  },
  {
    "term": [
      "Frontiers of Science"
    ],
    "description": "<b>Frontiers of Science</b> is an organization founded by the ETO. Its superficial purpose is \"exploring the limitations of science\". The real purpose is to undermine scientists' faith in science, leading them to doubt the fundamental laws of physics."
  },
  {
    "term": [
      "Ye's secret"
    ],
    "description": "In the story, Ye's daughter discovers that Ye is the lead of ETO; Ye is the prime culprit behind the suicide of scientists. She has difficulty accepting that fact."
  },
  {
    "term": [
      "Three Body"
    ],
    "description": "The game <b><i>Three Body</i></b> is designed by ETO. It is used to screen the scientists who are sympathetic to Trisolarans. ETO uses this game to recruit."
  },
  {
    "term": [
      "Planetary Defense Council",
      "PDC"
    ],
    "description": "<p><b>Planetary Defense Council</b> (PDC) is an organization formed to defend Earth against the Trisolarans. Its goal is to develop an effective counterattack capability within 400 years, before the arrival of the First Trisolaris Fleet. </p>\n<p>The PDC designed Wallfacer Project, and it is successfully implemented. </p>"
  },
  {
    "term": [
      "Hibernation Technology"
    ],
    "description": "<b>Hibernation Technology</b>, a fictional technology, enables humans to travel to the future without lifespan consumption."
  },
  {
    "term": [
      "Planetary Intelligence Agency",
      "PIA"
    ],
    "description": "<b>PDC Strategic Intelligence Agency</b> (PIA) is a specialized department of the PDC. Unlike other departments, the PIA focuses on asymmetric strategy, using espionage, psychological warfare, and technical deception to combat the Trisolarans."
  },
  {
    "term": [
      "Staircase Program"
    ],
    "description": "<b>Staircase Program</b> is designed by the PIA. The program is to launch a spaceship with a spy to get the information of Trisolarans."
  },
  {
    "term": [
      "escapism"
    ],
    "description": "<b>Escapism</b> is a school of thought that advocates for fleeing the Solar System to avoid the Trisolaran threat."
  },
  {
    "term": [
      "Wallfacer Project"
    ],
    "description": "<p><b>Wallfacer Project</b> is launched by the PDC. The project is carried out by four individuals known as Wallfacers. Their job is to design a strategic plan based solely on their own thinking. They must keep their plans entirely to themselves. </p>\n<p>The project is based on the fact that Trisolarans are not good at strategic thinking. </p>"
  },
  {
    "term": [
      "Wallfacer",
      "Wallfacers"
    ],
    "description": "<b>Wallfacers</b> are the central figures responsible for carrying out the Wallfacer Project. They operate with virtually unlimited authority, free from external oversight."
  },
  {
    "term": [
      "Wallbreaker",
      "Wallbreakers"
    ],
    "description": "<b>Wallbreakers</b> are appointed by the ETO. Wallbreakers assist the Trisolarans in identifying and undermining the Wallfacers' strategies."
  },
  {
    "term": [
      "Stars Our Destination Project"
    ],
    "description": "The <b>Stars Our Destination Project</b> is launched by the United Nations. The project auctions off stars and planets outside the Solar System. The proceeds are used to fund Earth's defense."
  },
  {
    "term": [
      "Dark Forest Theory"
    ],
    "description": "<p><b>Dark Forest Theory</b> is the key setting of the story. Dark Forest Theory is a fictional theory, which assumes two axioms.</p>\n<ol>\n<li><b>Survival is the primary need of civilization. </b></li>\n<li><b>Civilization continuously grows and expands, but the total matter in the universe remains constant. </b></li>\n</ol>\n<p>From these axioms, together with the hypothesis that <b>technological explosions are common throughout the universe</b>, it can be inferred that a <b>suspicion chain</b> exists among civilizations. </p>\n<p>Dark Forest Theory reveals that civilizations in the universe are both hunters and prey. Specifically, according to the theory, once a civilization reveals its location, it will be attacked by others. The theory offers an explanation for the Fermi Paradox and exposes the brutal reality of the universe. </p>"
  },
  {
    "term": [
      "Photoid"
    ],
    "description": "<b>Photoid</b> is a fictional cosmic weapon used for Dark Forest Strike. It can easily destroy a star."
  },
  {
    "term": [
      "Dark Forest Strike"
    ],
    "description": "When a civilization exposes its position, the attack it gets is called <b>Dark Forest Strike</b>. Despite its catastrophic impact, a Dark Forest Strike is surprisingly low-cost and is used casually to wipe out weaker civilizations."
  },
  {
    "term": [
      "Luo's experiment"
    ],
    "description": "<b>Luo's experiment</b> is to test if Dark Forest Theory is correct. In the story, Luo exposes the position of 187J3X1 to the universe, and then it is attacked."
  },
  {
    "term": [
      "Droplet"
    ],
    "description": "<p><b>Droplet</b> is a fictional weapon created by Trisolarans. It is made from a material governed by the strong interaction force.. It is highly destructive to humans. </p>\n<p>\"Your destruction is none of my concern. \"</p>"
  },
  {
    "term": [
      "Snow Project"
    ],
    "description": "<b>Snow Project</b> is designed by Luo. Luo depends on the project to build the Dark Forest Deterrence."
  },
  {
    "term": [
      "Dark Forest Deterrence"
    ],
    "description": "In the story, the <b>Dark Forest Deterrence</b> built by Luo is the means of mutual destruction. It can expose the location of Trisolaris. However, since Trisolaris is very close to Earth, it will also reveal Earth's location."
  },
  {
    "term": [
      "Swordholder"
    ],
    "description": "<p>Swordholder</b> is the person who control the facility for Dark Forest Deterrence and determine when launches the deterrence. </p>\n<p>In the story, the second Swordholder Cheng Xin does not have the consciousness to destroy both Trisolaris and the Earth, so the deterrence fails when Trisolarans attack the facility used for Dark Forest Deterrence. </p>"
  },
  {
    "term": [
      "Black Domain Project"
    ],
    "description": "The <b>Black Domain Project</b> is to reduce the lightspeed in the Solar System. This can help prevent potential attacks from outside the Solar System."
  },
  {
    "term": [
      "Bunker Project"
    ],
    "description": "<b>Bunker Project</b> is to use the planets of the Solar System as \"bunkers\" to protect the spacecrafts that people are living from Photoid."
  },
  {
    "term": [
      "Curvature Engine"
    ],
    "description": "<b>Curvature Engine</b> is a fictional technology. The spaceships using Curvature Engine can reach a speed above 99.9% of lightspeed."
  },
  {
    "term": [
      "Singer Civilization"
    ],
    "description": "<b>Singer Civilizaion</b> is an unknown high-level civilization that attack humans by Dual-Vector Foil."
  },
  {
    "term": [
      "Dual-Vector Foil"
    ],
    "description": "<b>Dual-Vector Foil</b> is a fictional weapon that is used for Dark Forest Strike. It can easily make a solar system two-dimensionalized."
  }
]